/**
 * 
 */
const PROJECT_LISTS = [
  {
    id: 1,
    name: "有信查询-微信公众号",
    discription:
      "公司从事P2P平台服务,急需信贷前置风控为公司有信钱包信贷平台提供前置风控服务，对接各方提供的逾期查询，黑名单查询实现多功能查询，提高信贷匹配度满足各端用户需求。", // 项目描述
    content: `1.参与项目的讨论和需求评审<br/>
      2.独立完成公众号开发和迭代工作<br/>
      3.使用Vue及其全家桶进行开发并进一步封装<br/>
      4.对接设计，百分百还原设计稿<br/>
      5.对接测试，自测问题及修复，避免线上功能异常`, // 项目职责
    summary:
      "使用Chrome性能调试工具分析页面加载速度，优化页面响应速度，使首页加载在1s以内，减小Vue-cli打包大小", // 总结
    startTime: "2020-01-01", // 项目开始日期
    endTime: "2020-01-02", // 项目结束日期
    images: [], // 项目相关介绍图片
  },
];

export default PROJECT_LISTS;
